app/controllers/recipes_controller.rb

SELECT `categories`.* FROM `categories`
---
  def new
      @recipe = Recipe.new
      @categories = Category.all

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO `recipes` (`ingredients`, `steps`, `user_id`, `created_at`, `updated_at`) VALUES ('1 cup flour; 2 cups cornmeal; 1/2 cup sugar; 3 teaspoons baking powder; 1/4 teaspoon salt; 2 eggs; 2 cups milk; 1 tablespoon butter, melted', 'Sift all dry ingredients together Beat egg and add milk. Stir into dry ingredients. Stir in melted butter. Bake at 400 degrees in greased pans or paper muffin cups for 20-30 minutes or until golden brown.', 1, '2015-05-19 17:59:02', '2015-05-19 17:59:02')
---
  def create
     @recipe = Recipe.new(recipe_params)

     if @recipe.save

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`recipe_id` = 1
---
  def edit
    @recipe = Recipe.find(params[:id])
    @categories = Category.all