app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @recipes = @user.recipes
    @posts = @user.posts.limit(3)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`user_id` = 1